lang/javascript-distilled.org
#+TITLE: JavaScript 编程语言精粹
#+AUTHOR: Jinghui Hu
#+EMAIL: hujinghui@buaa.edu.cn
#+DATE: <2019-07-02 Tue 11:04:00>
#+HTML_LINK_UP: ../readme.html
#+HTML_LINK_HOME: ../index.html
#+TAGS: javascript programming language distilled

* 基础知识
** 常量和变量
   定义常量使用 =const= 关键字，变量有 =var= 和 =let= ，其中 =var= 是旧版本的定
   义变量方法，它没有 scope，但是 =let= 是有 scope 的，所以无论如何 *定义变量请
   使用 let 关键字*

   #+BEGIN_SRC js
    > if (true) {
    ... var v1 = true;
    ... }
    > v1
    true
    > if (true) {
    ... let v2 = true;
    ... }
    > v2
    Thrown:
    ReferenceError: v2 is not defined
    >
   #+END_SRC

** null 和 undefined
   =null= 在 JavaScript 中表示空值， =undefined= 通常是为没有赋值的变量。通常变
   量为空的时候要使用 =null= ，尽量避免 =undefined=
   #+BEGIN_SRC js
     > null == undefined
     true
     > null === undefined
     false
     > undefined == undefined
     true
     > typeof undefined
     'undefined'
     > typeof null
     'object'
     > typeof true
     'boolean'
     > typeof 0
     'number'
     >
   #+END_SRC

** 类型
*** 基本类型
    JavaScript 的基本类型包括： ~string~, ~number~, ~boolean~, ~symbol~, ~null~
    和 ~undefined~
    - 普通对象都有相应的方法
    - ~null~ 和 ~undefined~ 没有方法

    JavaScript 的基本类型有以下 =包装类= ，例如： ~String~, ~Number~, ~Boolean~
    和 ~Symbol~

*** 类型转换
    转换成字符串
    #+BEGIN_SRC js
      > String(true)
      'true'
      > String(null)
      'null'
      > String(23)
      '23'
      >String(undefined)
      'undefined'
      > '' + 21
      '21'
      > 2 + 2 + '1'
      '41'
    #+END_SRC
    转换成数值
    #+BEGIN_SRC js
      > "6" / "3"
      2
      > Number("234")
      234
      > Number("str")
      NaN
      > Number(null)
      0
      > Number(undefined)
      NaN
      > Number(true)
      1
      > Number(false)
      0
      > +'12.3'
      12.3
      > parseInt('23')
      23
      > parseFloat('3.14')
      3.14
    #+END_SRC

* 控制流
** if 条件, switch case 多层条件控制
   #+BEGIN_SRC js
     if (year < 2015) {
       alert( 'Too early...' );
     } else if (year > 2015) {
       alert( 'Too late' );
     } else {
       alert( 'Exactly!' );
     }

     let a = 2 + 2;

     switch (a) {
       case 3:
         alert( 'Too small' );
         break;
       case 4:
         alert( 'Exactly!' );
         break;
       case 5:
         alert( 'Too large' );
         break;
       default:
         alert( "I don't know such values" );
     }
   #+END_SRC

** while for 循环
   #+BEGIN_SRC js
     let i = 0;
     while (i < 3) { // shows 0, then 1, then 2
       alert( i );
       i++;
     }

     do {
       alert( i );
       i++;
     } while (i < 3);

     for (let i = 0; i < 3; i++) { // shows 0, then 1, then 2
       alert(i);
     }
   #+END_SRC

** try catch 处理异常
   异常一般用到的比较少，这里先记上
   #+BEGIN_SRC js
     try {
       alert( 'try' );
       if (confirm('Make an error?')) BAD_CODE();
     } catch (e) {
       alert( 'catch' );
     } finally {
       alert( 'finally' );
     }
   #+END_SRC

* 函数
