lang/javascript-distilled.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-07-30 Tue 16:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>JavaScript 编程语言精粹</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jinghui Hu" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../readme.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">JavaScript 编程语言精粹</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf792140">1. 基础知识</a>
<ul>
<li><a href="#org3800a99">1.1. 常量和变量</a></li>
<li><a href="#org6686cef">1.2. null 和 undefined</a></li>
<li><a href="#org92434bf">1.3. 类型</a>
<ul>
<li><a href="#org5aab7a6">1.3.1. 基本类型</a></li>
<li><a href="#orgbfca358">1.3.2. 类型转换</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org23adb65">2. 控制流</a>
<ul>
<li><a href="#org6c5dbb1">2.1. if 条件, switch case 多层条件控制</a></li>
<li><a href="#orgc58df62">2.2. while for 循环</a></li>
<li><a href="#org130f0b0">2.3. try catch 处理异常</a></li>
</ul>
</li>
<li><a href="#org84a8465">3. 函数</a>
<ul>
<li><a href="#org9f8fe1a">3.1. 函数定义</a></li>
<li><a href="#org8fdb078">3.2. 带默认值的函数</a></li>
<li><a href="#orgafbce62">3.3. Rest 参数和 <code>...</code> 操作符</a>
<ul>
<li><a href="#orgc422108">3.3.1. Rest 参数</a></li>
<li><a href="#org9387563">3.3.2. <code>arguments</code> 变量</a></li>
<li><a href="#org335de0c">3.3.3. <code>...</code> 操作符</a></li>
</ul>
</li>
<li><a href="#org0a88a0e">3.4. 函数对象和 NFE</a>
<ul>
<li><a href="#orgf705e5f">3.4.1. 函数对象</a></li>
<li><a href="#orgc9e38ff">3.4.2. NFE</a></li>
</ul>
</li>
<li><a href="#orge5dabd0">3.5. 调度 setTimeout/setInterval</a>
<ul>
<li><a href="#org63cb3bf">3.5.1. setTimeout</a></li>
<li><a href="#org800522d">3.5.2. clearTimeout</a></li>
<li><a href="#org72008ba">3.5.3. setInterval</a></li>
</ul>
</li>
<li><a href="#orga3f0015">3.6. 函数 <code>this</code> 绑定</a></li>
<li><a href="#org2e52c55">3.7. Currying</a></li>
</ul>
</li>
<li><a href="#orgde17c70">4. 标准内置对象</a>
<ul>
<li><a href="#org20b2423">4.1. Number 数字</a>
<ul>
<li><a href="#org0bf73b6">4.1.1. 转化成数字</a></li>
<li><a href="#org6be83df">4.1.2. 数字截断</a></li>
<li><a href="#org9fe7ddd">4.1.3. 其它函数</a></li>
<li><a href="#org02f76d1">4.1.4. 特殊数字测试</a></li>
</ul>
</li>
<li><a href="#org94f7e2d">4.2. String 字符串</a>
<ul>
<li><a href="#orge18e59a">4.2.1. 定义字符串</a></li>
<li><a href="#org3864a89">4.2.2. 字符串长度</a></li>
<li><a href="#orgce7dc2b">4.2.3. 获取子字符串</a></li>
<li><a href="#orgb220657">4.2.4. 字符串查找</a></li>
<li><a href="#orge963c20">4.2.5. 字符串替换/正则表达式</a></li>
<li><a href="#org331395a">4.2.6. 其它字符串函数</a></li>
</ul>
</li>
<li><a href="#orgfae7227">4.3. Array 数组</a>
<ul>
<li><a href="#orga5fbdd9">4.3.1. 创建</a></li>
<li><a href="#org385e2be">4.3.2. 修改元素：添加/删除</a></li>
<li><a href="#org4ef8a6b">4.3.3. 查找</a></li>
<li><a href="#orgc7e727f">4.3.4. 迭代</a></li>
<li><a href="#org12d0d9e">4.3.5. 数组变换</a></li>
<li><a href="#orgc60c08b">4.3.6. 其它</a></li>
</ul>
</li>
<li><a href="#orga7aa9ff">4.4. 迭代器/数组类似物</a>
<ul>
<li><a href="#orgf1d7bab">4.4.1. Array-like 和 Iterable</a></li>
<li><a href="#org880a7bb">4.4.2. <code>Array.from</code></a></li>
</ul>
</li>
<li><a href="#org51f6e06">4.5. Map/Set 等标准内置对象</a></li>
<li><a href="#org151bda0">4.6. Object 对象</a>
<ul>
<li><a href="#org47099df">4.6.1. 定义对象</a></li>
<li><a href="#orgf937c97">4.6.2. 对象基本操作</a></li>
<li><a href="#org5c47be9">4.6.3. 对象引用/复制</a></li>
<li><a href="#org8026d98">4.6.4. 更新对象</a></li>
<li><a href="#orge1fd7b4">4.6.5. 对象的键和值</a></li>
</ul>
</li>
<li><a href="#orgf625b67">4.7. Date 时间和日期</a>
<ul>
<li><a href="#org73e8d3a">4.7.1. 创建日期对象</a></li>
<li><a href="#org7b72f89">4.7.2. 时间函数</a></li>
<li><a href="#orgdf00197">4.7.3. 时间戳</a></li>
<li><a href="#orge3016c2">4.7.4. 字符串和 Date 互转</a></li>
</ul>
</li>
<li><a href="#org4d46e30">4.8. JSON</a></li>
</ul>
</li>
<li><a href="#orgcead471">5. 面向对象知识</a>
<ul>
<li><a href="#orgc9c5fdd">5.1. <code>new</code> 关键字和构造器</a>
<ul>
<li><a href="#org1c07f0a">5.1.1. 构造器</a></li>
<li><a href="#orgc56b077">5.1.2. <code>new</code> 操作符</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgf792140" class="outline-2">
<h2 id="orgf792140"><span class="section-number-2">1</span> 基础知识</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org3800a99" class="outline-3">
<h3 id="org3800a99"><span class="section-number-3">1.1</span> 常量和变量</h3>
<div class="outline-text-3" id="text-1-1">
<p>
定义常量使用 <code>const</code> 关键字，变量有 <code>var</code> 和 <code>let</code> ，其中 <code>var</code> 是旧版本的定
义变量方法，它没有 scope，但是 <code>let</code> 是有 scope 的，所以无论如何 <b>定义变量请
使用 let 关键字</b>
</p>

<div class="org-src-container">
<pre class="src src-js">&gt; <span style="color: #859900;">if</span> (<span style="color: #268bd2;">true</span>) {
... <span style="color: #859900;">var</span> <span style="color: #6c71c4;">v1</span> = <span style="color: #268bd2;">true</span>;
... }
&gt; v1
<span style="color: #268bd2;">true</span>
&gt; <span style="color: #859900;">if</span> (<span style="color: #268bd2;">true</span>) {
... <span style="color: #859900;">let</span> <span style="color: #6c71c4;">v2</span> = <span style="color: #268bd2;">true</span>;
... }
&gt; v2
Thrown:
ReferenceError: v2 is not defined
&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org6686cef" class="outline-3">
<h3 id="org6686cef"><span class="section-number-3">1.2</span> null 和 undefined</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<code>null</code> 在 JavaScript 中表示空值， <code>undefined</code> 通常是为没有赋值的变量。通常变
量为空的时候要使用 <code>null</code> ，尽量避免 <code>undefined</code>
</p>
<div class="org-src-container">
<pre class="src src-js">&gt; <span style="color: #268bd2;">null</span> == <span style="color: #268bd2;">undefined</span>
<span style="color: #268bd2;">true</span>
&gt; <span style="color: #268bd2;">null</span> === <span style="color: #268bd2;">undefined</span>
<span style="color: #268bd2;">false</span>
&gt; <span style="color: #268bd2;">undefined</span> == <span style="color: #268bd2;">undefined</span>
<span style="color: #268bd2;">true</span>
&gt; <span style="color: #859900;">typeof</span> <span style="color: #268bd2;">undefined</span>
<span style="color: #2aa198;">'undefined'</span>
&gt; <span style="color: #859900;">typeof</span> <span style="color: #268bd2;">null</span>
<span style="color: #2aa198;">'object'</span>
&gt; <span style="color: #859900;">typeof</span> <span style="color: #268bd2;">true</span>
<span style="color: #2aa198;">'boolean'</span>
&gt; <span style="color: #859900;">typeof</span> 0
<span style="color: #2aa198;">'number'</span>
&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org92434bf" class="outline-3">
<h3 id="org92434bf"><span class="section-number-3">1.3</span> 类型</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org5aab7a6" class="outline-4">
<h4 id="org5aab7a6"><span class="section-number-4">1.3.1</span> 基本类型</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
JavaScript 的基本类型包括： <code>string</code>, <code>number</code>, <code>boolean</code>, <code>symbol</code>, <code>null</code>
和 <code>undefined</code>
</p>
<ul class="org-ul">
<li>普通对象都有相应的方法</li>
<li><code>null</code> 和 <code>undefined</code> 没有方法</li>
</ul>

<p>
JavaScript 的基本类型有以下 <code>包装类</code> ，例如： <code>String</code>, <code>Number</code>, <code>Boolean</code>
和 <code>Symbol</code>
</p>
</div>
</div>

<div id="outline-container-orgbfca358" class="outline-4">
<h4 id="orgbfca358"><span class="section-number-4">1.3.2</span> 类型转换</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
转换成字符串
</p>
<div class="org-src-container">
<pre class="src src-js">&gt; String(<span style="color: #268bd2;">true</span>)
<span style="color: #2aa198;">'true'</span>
&gt; String(<span style="color: #268bd2;">null</span>)
<span style="color: #2aa198;">'null'</span>
&gt; String(23)
<span style="color: #2aa198;">'23'</span>
&gt;String(<span style="color: #268bd2;">undefined</span>)
<span style="color: #2aa198;">'undefined'</span>
&gt; <span style="color: #2aa198;">''</span> + 21
<span style="color: #2aa198;">'21'</span>
&gt; 2 + 2 + <span style="color: #2aa198;">'1'</span>
<span style="color: #2aa198;">'41'</span>
</pre>
</div>
<p>
转换成数值
</p>
<div class="org-src-container">
<pre class="src src-js">&gt; <span style="color: #2aa198;">"6"</span> / <span style="color: #2aa198;">"3"</span>
2
&gt; Number(<span style="color: #2aa198;">"234"</span>)
234
&gt; Number(<span style="color: #2aa198;">"str"</span>)
<span style="color: #268bd2;">NaN</span>
&gt; Number(<span style="color: #268bd2;">null</span>)
0
&gt; Number(<span style="color: #268bd2;">undefined</span>)
<span style="color: #268bd2;">NaN</span>
&gt; Number(<span style="color: #268bd2;">true</span>)
1
&gt; Number(<span style="color: #268bd2;">false</span>)
0
&gt; +<span style="color: #2aa198;">'12.3'</span>
12.3
&gt; parseInt(<span style="color: #2aa198;">'23'</span>)
23
&gt; parseFloat(<span style="color: #2aa198;">'3.14'</span>)
3.14
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org23adb65" class="outline-2">
<h2 id="org23adb65"><span class="section-number-2">2</span> 控制流</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org6c5dbb1" class="outline-3">
<h3 id="org6c5dbb1"><span class="section-number-3">2.1</span> if 条件, switch case 多层条件控制</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #859900;">if</span> (year &lt; 2015) {
  alert( <span style="color: #2aa198;">'Too early...'</span> );
} <span style="color: #859900;">else</span> <span style="color: #859900;">if</span> (year &gt; 2015) {
  alert( <span style="color: #2aa198;">'Too late'</span> );
} <span style="color: #859900;">else</span> {
  alert( <span style="color: #2aa198;">'Exactly!'</span> );
}

<span style="color: #859900;">let</span> <span style="color: #6c71c4;">a</span> = 2 + 2;

<span style="color: #859900;">switch</span> (a) {
  <span style="color: #859900;">case</span> 3:
    alert( <span style="color: #2aa198;">'Too small'</span> );
    <span style="color: #859900;">break</span>;
  <span style="color: #859900;">case</span> 4:
    alert( <span style="color: #2aa198;">'Exactly!'</span> );
    <span style="color: #859900;">break</span>;
  <span style="color: #859900;">case</span> 5:
    alert( <span style="color: #2aa198;">'Too large'</span> );
    <span style="color: #859900;">break</span>;
  <span style="color: #859900;">default</span>:
    alert( <span style="color: #2aa198;">"I don't know such values"</span> );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc58df62" class="outline-3">
<h3 id="orgc58df62"><span class="section-number-3">2.2</span> while for 循环</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #859900;">let</span> <span style="color: #6c71c4;">i</span> = 0;
<span style="color: #859900;">while</span> (i &lt; 3) { <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">shows 0, then 1, then 2</span>
  alert( i );
  i++;
}

<span style="color: #859900;">do</span> {
  alert( i );
  i++;
} <span style="color: #859900;">while</span> (i &lt; 3);

<span style="color: #859900;">for</span> (<span style="color: #859900;">let</span> <span style="color: #6c71c4;">i</span> = 0; i &lt; 3; i++) { <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">shows 0, then 1, then 2</span>
  alert(i);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org130f0b0" class="outline-3">
<h3 id="org130f0b0"><span class="section-number-3">2.3</span> try catch 处理异常</h3>
<div class="outline-text-3" id="text-2-3">
<p>
异常一般用到的比较少，这里先记上
</p>
<div class="org-src-container">
<pre class="src src-js"><span style="color: #859900;">try</span> {
  alert( <span style="color: #2aa198;">'try'</span> );
  <span style="color: #859900;">if</span> (confirm(<span style="color: #2aa198;">'Make an error?'</span>)) BAD_CODE();
} <span style="color: #859900;">catch</span> (e) {
  alert( <span style="color: #2aa198;">'catch'</span> );
} <span style="color: #859900;">finally</span> {
  alert( <span style="color: #2aa198;">'finally'</span> );
}
</pre>
</div>
</div>
</div>
</div>
