lang/javascript-distilled.html

<div id="outline-container-org84a8465" class="outline-2">
<h2 id="org84a8465"><span class="section-number-2">3</span> 函数</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org9f8fe1a" class="outline-3">
<h3 id="org9f8fe1a"><span class="section-number-3">3.1</span> 函数定义</h3>
<div class="outline-text-3" id="text-3-1">
<p>
函数是 JavaScript 的重要工具，定义函数有以下几种方法
</p>
<div class="org-src-container">
<pre class="src src-js"><span style="color: #859900;">function</span> <span style="color: #b58900;">sum</span>(<span style="color: #6c71c4;">a</span>, <span style="color: #6c71c4;">b</span>) {
  <span style="color: #859900;">let</span> <span style="color: #6c71c4;">result</span> = a + b;
  <span style="color: #859900;">return</span> result;
}
<span style="color: #859900;">let</span> <span style="color: #6c71c4;">sum</span> = <span style="color: #859900;">function</span>(<span style="color: #6c71c4;">a</span>, <span style="color: #6c71c4;">b</span>) {
  <span style="color: #859900;">let</span> <span style="color: #6c71c4;">result</span> = a + b;
  <span style="color: #859900;">return</span> result;
}

<span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">expression at the right side</span>
<span style="color: #859900;">let</span> <span style="color: #6c71c4;">sum</span> = (a, b) =&gt; a + b;
<span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">or multi-line syntax with { ... }, need return here:</span>
<span style="color: #859900;">let</span> <span style="color: #6c71c4;">sum</span> = (a, b) =&gt; {
  <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">...</span>
  <span style="color: #859900;">return</span> a + b;
}

<span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">without arguments</span>
<span style="color: #859900;">let</span> <span style="color: #6c71c4;">sayHi</span> = () =&gt; alert(<span style="color: #2aa198;">"Hello"</span>);
<span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">with a single argument</span>
<span style="color: #859900;">let</span> <span style="color: #268bd2;">double</span> = n =&gt; n * 2;
</pre>
</div>

<p>
箭头函数绑定了上下文，所以箭头函数有以下特点：
</p>
<ul class="org-ul">
<li>没有 <code>this</code></li>
<li>没有 <code>arguments</code></li>
<li>不能使用 <code>new</code> 来创建对象</li>
<li>没有 <code>super</code></li>
</ul>
</div>
</div>

<div id="outline-container-org8fdb078" class="outline-3">
<h3 id="org8fdb078"><span class="section-number-3">3.2</span> 带默认值的函数</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #859900;">function</span> <span style="color: #b58900;">showMessage</span>(<span style="color: #6c71c4;">from</span>, <span style="color: #6c71c4;">text</span>) {
  alert(from + <span style="color: #2aa198;">': '</span> + text);
}
<span style="color: #859900;">function</span> <span style="color: #b58900;">showMessage2</span>(<span style="color: #6c71c4;">from</span>, <span style="color: #6c71c4;">text</span>=<span style="color: #2aa198;">'hello'</span>) {
  alert(from + <span style="color: #2aa198;">': '</span> + text);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgafbce62" class="outline-3">
<h3 id="orgafbce62"><span class="section-number-3">3.3</span> Rest 参数和 <code>...</code> 操作符</h3>
<div class="outline-text-3" id="text-3-3">
</div>
<div id="outline-container-orgc422108" class="outline-4">
<h4 id="orgc422108"><span class="section-number-4">3.3.1</span> Rest 参数</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
JavaScript 中的三点操作符 <code>...</code> 可以定义变长的参数
</p>
<div class="org-src-container">
<pre class="src src-js"><span style="color: #859900;">function</span> <span style="color: #b58900;">sumAll</span>(...args) { <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">args is the name for the array</span>
  <span style="color: #859900;">let</span> <span style="color: #6c71c4;">sum</span> = 0;
  <span style="color: #859900;">for</span> (<span style="color: #859900;">let</span> <span style="color: #6c71c4;">arg</span> of args) sum += arg;
  <span style="color: #859900;">return</span> sum;
}

sumAll(1); <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">1</span>
sumAll(1, 2); <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">3</span>
sumAll(1, 2, 3); <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">6</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9387563" class="outline-4">
<h4 id="org9387563"><span class="section-number-4">3.3.2</span> <code>arguments</code> 变量</h4>
<div class="outline-text-4" id="text-3-3-2">
<p>
JavaScript 的每个函数中都默认传入一个 Array-like 的 <code>arguments</code> 变量，用于处
理函数的对象。使用 <code>arguments</code> 主要是兼容以前 JavaScript 不支持 Rest 参数
</p>
<div class="org-src-container">
<pre class="src src-js"><span style="color: #859900;">function</span> <span style="color: #b58900;">showName</span>() {
  console.log(<span style="color: #268bd2;">arguments</span>.length);
  console.log(<span style="color: #268bd2;">arguments</span>[0]);
  console.log(<span style="color: #268bd2;">arguments</span>[1]);

  <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">it's iterable</span>
  <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">for(let arg of arguments) alert(arg);</span>
}

<span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">shows: 2, Julius, Caesar</span>
showName(<span style="color: #2aa198;">"Julius"</span>, <span style="color: #2aa198;">"Caesar"</span>);
<span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">shows: 1, Ilya, undefined (no second argument)</span>
showName(<span style="color: #2aa198;">"Ilya"</span>);
</pre>
</div>
</div>
</div>

<div id="outline-container-org335de0c" class="outline-4">
<h4 id="org335de0c"><span class="section-number-4">3.3.3</span> <code>...</code> 操作符</h4>
<div class="outline-text-4" id="text-3-3-3">
<p>
<code>...</code> 可以将数组中作为变长参数传入函数中
</p>
<div class="org-src-container">
<pre class="src src-js">&gt; arr = [1, 2, 5]
[ 1, 2, 5 ]
&gt; Math.max(1,2,5)
5
&gt; Math.max(arr)
<span style="color: #268bd2;">NaN</span>
&gt; Math.max(...arr)
5
</pre>
</div>

<p>
<code>...</code> 可以合并数组
</p>
<div class="org-src-container">
<pre class="src src-js">&gt; <span style="color: #859900;">let</span> <span style="color: #6c71c4;">a</span> = [1, 3, 5];
&gt; <span style="color: #859900;">let</span> <span style="color: #6c71c4;">b</span> = [2, 4, 6];
&gt; [...a, ...b]
[ 1, 3, 5, 2, 4, 6 ]
&gt; Math.max(9, ...a, ...b)
9
&gt;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org0a88a0e" class="outline-3">
<h3 id="org0a88a0e"><span class="section-number-3">3.4</span> 函数对象和 NFE</h3>
<div class="outline-text-3" id="text-3-4">
<p>
JavaScript 中函数也是一种对象，所以函数都是 <code>Function</code> 的实例。NFE 是命名函数
表达式（Named Function Expression）。
</p>
</div>

<div id="outline-container-orgf705e5f" class="outline-4">
<h4 id="orgf705e5f"><span class="section-number-4">3.4.1</span> 函数对象</h4>
<div class="outline-text-4" id="text-3-4-1">
<ul class="org-ul">
<li>函数对象都包含 <code>name</code> 属性，表示函数的名称</li>
<li>函数对象包含 <code>length</code> 属性，表示函数的参数的长度</li>
</ul>
<div class="org-src-container">
<pre class="src src-js">&gt; <span style="color: #859900;">function</span> sayHi() { console.log(<span style="color: #2aa198;">'hello'</span>); }
&gt; sayHi.name
<span style="color: #2aa198;">'sayHi'</span>
&gt; sayHi.length
0
&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc9e38ff" class="outline-4">
<h4 id="orgc9e38ff"><span class="section-number-4">3.4.2</span> NFE</h4>
<div class="outline-text-4" id="text-3-4-2">
<p>
NFE 在函数定义赋值前重新添加一个函数名称，具体如下：
</p>
<div class="org-src-container">
<pre class="src src-js"><span style="color: #859900;">let</span> <span style="color: #6c71c4;">sayHi</span> = <span style="color: #859900;">function</span> func(<span style="color: #6c71c4;">who</span>) { <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">additional func as name</span>
  alert(<span style="color: #2aa198;">`Hello, ${who}`</span>);
};
</pre>
</div>
<p>
这样定义的好处是：
</p>
<ul class="org-ul">
<li>func 函数名对函数内部可见</li>
<li>func 函数名对函数外部不可见</li>
</ul>
<div class="org-src-container">
<pre class="src src-js"><span style="color: #859900;">let</span> <span style="color: #6c71c4;">sayHi</span> = <span style="color: #859900;">function</span> func(<span style="color: #6c71c4;">who</span>) {
  <span style="color: #859900;">if</span> (who) {
    alert(<span style="color: #2aa198;">`Hello, ${who}`</span>);
  } <span style="color: #859900;">else</span> {
    func(<span style="color: #2aa198;">"Guest"</span>); <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">use func to re-call itself</span>
  }
};

sayHi(); <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">Hello, Guest</span>
<span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">But this won't work:</span>
func(); <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">Error, func is not defined (not visible outside of the function)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orge5dabd0" class="outline-3">
<h3 id="orge5dabd0"><span class="section-number-3">3.5</span> 调度 setTimeout/setInterval</h3>
<div class="outline-text-3" id="text-3-5">
<ul class="org-ul">
<li><code>setTimeout</code> 设置一定计时后运行</li>
<li><code>setInterval</code> 设置一定周期运行函数</li>
<li><code>clearTimeout/clearInterval</code> 取消计时器</li>
</ul>
</div>

<div id="outline-container-org63cb3bf" class="outline-4">
<h4 id="org63cb3bf"><span class="section-number-4">3.5.1</span> setTimeout</h4>
<div class="outline-text-4" id="text-3-5-1">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #859900;">let</span> <span style="color: #6c71c4;">timerId</span> = setTimeout(func|code, delay[, arg1, arg2...])
</pre>
</div>
<ul class="org-ul">
<li><code>func</code> 回调函数</li>
<li><code>delay</code> 延迟毫秒数</li>
<li><code>arg1, arg2, ...</code> 回调函数的参数</li>
</ul>
<div class="org-src-container">
<pre class="src src-js"><span style="color: #859900;">function</span> <span style="color: #b58900;">sayHi</span>() {
  console.log(<span style="color: #2aa198;">'Hello'</span>);
}

setTimeout(sayHi, 1000);
</pre>
</div>

<p>
<code>setTimeout(func,0)</code> 是在定义后里面运行函数，这个可以实现异步调用，例如下面
的例子中会在显示 Hello 过后立马显示 World
</p>
<div class="org-src-container">
<pre class="src src-js">setTimeout(() =&gt; alert(<span style="color: #2aa198;">"World"</span>), 0);

alert(<span style="color: #2aa198;">"Hello"</span>);
</pre>
</div>
<p>
另外使用 <code>setTimeout(func,0)</code> 可以将高消耗 CPU 的工作放在初始化过后进行
</p>
</div>
</div>

<div id="outline-container-org800522d" class="outline-4">
<h4 id="org800522d"><span class="section-number-4">3.5.2</span> clearTimeout</h4>
<div class="outline-text-4" id="text-3-5-2">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #859900;">let</span> <span style="color: #6c71c4;">timerId</span> = setTimeout(...);
clearTimeout(timerId);
</pre>
</div>
</div>
</div>
