lang/javascript-distilled.org
*** setInterval
    #+BEGIN_SRC js
      let timerId = setInterval(func|code, delay[, arg1, arg2...])
    #+END_SRC
    参数和 ~setTimeout~ 类似

    #+BEGIN_SRC js
      // repeat with the interval of 2 seconds
      let timerId = setInterval(() => alert('tick'), 2000);

      // after 5 seconds stop
      setTimeout(() => { clearInterval(timerId); alert('stop'); }, 5000);
    #+END_SRC

** 函数 ~this~ 绑定
   - ~func.bind(context, ...args)~ 绑定 func 的 ~this~ 到 context，详见 [[https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Function/bind][bind]]
   - ~func.call(context, ...args)~ 绑定 func 的 ~this~ 到 context, 然后调用函数
     func，将 =...args= 作为参数传入，详见 [[https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Function/call][call]]
   - ~func.apply(context, args)~ 绑定 func 的 ~this~ 到 context, 然后调用函数
     func，将 Array-like 的 =args= 作为参数传入，详见 [[https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Function/apply][apply]]

** Currying
   Currying 将 ~f(a,b,c)~ 转化成 ~f(a)(b)(c)~ 这样的调用。一个简单的 curry 实现如
   下：
   #+BEGIN_SRC js
     function curry(func) {

       return function curried(...args) {
         if (args.length >= func.length) {
           return func.apply(this, args);
         } else {
           return function(...args2) {
             return curried.apply(this, args.concat(args2));
           }
         }
       };

     }
   #+END_SRC

   lodash 库提供 [[https://lodash.com/docs/4.17.15#curry][_.curry]] 实现的工具函数
   #+BEGIN_SRC js
     var abc = function(a, b, c) {
       return [a, b, c];
     };

     var curried = _.curry(abc);

     curried(1)(2)(3);
     // => [1, 2, 3]

     curried(1, 2)(3);
     // => [1, 2, 3]

     curried(1, 2, 3);
     // => [1, 2, 3]

     // Curried with placeholders.
     curried(1)(_, 3)(2);
     // => [1, 2, 3]
   #+END_SRC

* 标准内置对象
** Number 数字
*** 转化成数字
    - ~parseInt(str, base)~ 转化成整数
    - ~parseFloat(str)~ 转化成浮点数

*** 数字截断
    主要有： ~Math.floor~ , ~Math.ceil~, ~Math.round~, ~Math.trunc~ 这些方法，例
    子见下表

    |      | Math.floor | Math.ceil | Math.round | Math.trunc |
    |------+------------+-----------+------------+------------|
    |  3.1 |          3 |         4 |          3 |          3 |
    |  3.6 |          3 |         4 |          4 |          3 |
    | -1.1 |         -2 |        -1 |         -1 |         -1 |
    | -1.6 |         -2 |        -1 |         -2 |         -1 |

*** 其它函数
    - ~Math.random()~ 取 0 到 1 之间的随机数
    - ~Math.max(a, b, c, ..)~ 和 ~Math.min(a, b, c, ..)~ 取最值
    - ~Math.pow(n, power)~

*** 特殊数字测试
    - ~isFinite~ 如果不是无穷大，返回真；否则返回假。 ~Infinity~ 和 ~-Infinity~
      表示无穷大和无穷小
    - ~isNaN~ 测试是否是一个数字

    #+BEGIN_SRC js
      > isFinite(NaN)
      false
      > isFinite(-Infinity)
      false
      > isFinite(Infinity)
      false
      > isFinite(12)
      true
      > isNaN(NaN)
      true
      > isNaN(2)
      false
      > isNaN("ss")
      true
      >
    #+END_SRC

** String 字符串
   String 对象在 [[https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String][MDN]] 中有详细的介绍
*** 定义字符串
    注意使用 =${...}= 表达式
    #+BEGIN_SRC js
      > "Double quote"
      'Double quote'
      > 'Single quote'
      'Single quote'
      > let name = 'Jack'
      > `Hi, ${name}`
      'Hi, Jack'
      > `1 + 2 = ${1 + 2}`
      '1 + 2 = 3'
    #+END_SRC

*** 字符串长度
    ~str.length~ ，字符串长度是一个对象中的属性
    #+BEGIN_SRC js
      > 'hello'.length
      5
    #+END_SRC

*** 获取子字符串
    - ~[]~ 和 ~str.charAt(idx)~: 通过下标索引获取字符
    - ~str.slice(beginIndex[,endIndex])~ 获取子字符串，如果 beginIndex 或
      endIndex 是负表示反向索引
    - ~str.substring(indexStart[,indexEnd])~ 和 slice 和类似，但是 substring 支
      持 indexEnd 小于 indexStart
    #+BEGIN_SRC js
      > 'abcd'.substring(1,3)
      'bc'
      > 'abcd'.substring(3,1)
      'bc'
      > 'abcd'.slice(1,3)
      'bc'
      > 'abcd'.slice(3,1)
      ''
      >
    #+END_SRC

