lang/javascript-distilled.html

<div id="outline-container-org72008ba" class="outline-4">
<h4 id="org72008ba"><span class="section-number-4">3.5.3</span> setInterval</h4>
<div class="outline-text-4" id="text-3-5-3">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #859900;">let</span> <span style="color: #6c71c4;">timerId</span> = setInterval(func|code, delay[, arg1, arg2...])
</pre>
</div>
<p>
参数和 <code>setTimeout</code> 类似
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">repeat with the interval of 2 seconds</span>
<span style="color: #859900;">let</span> <span style="color: #6c71c4;">timerId</span> = setInterval(() =&gt; alert(<span style="color: #2aa198;">'tick'</span>), 2000);

<span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">after 5 seconds stop</span>
setTimeout(() =&gt; { clearInterval(timerId); alert(<span style="color: #2aa198;">'stop'</span>); }, 5000);
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga3f0015" class="outline-3">
<h3 id="orga3f0015"><span class="section-number-3">3.6</span> 函数 <code>this</code> 绑定</h3>
<div class="outline-text-3" id="text-3-6">
<ul class="org-ul">
<li><code>func.bind(context, ...args)</code> 绑定 func 的 <code>this</code> 到 context，详见 <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Function/bind">bind</a></li>
<li><code>func.call(context, ...args)</code> 绑定 func 的 <code>this</code> 到 context, 然后调用函数
func，将 <code>...args</code> 作为参数传入，详见 <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Function/call">call</a></li>
<li><code>func.apply(context, args)</code> 绑定 func 的 <code>this</code> 到 context, 然后调用函数
func，将 Array-like 的 <code>args</code> 作为参数传入，详见 <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Function/apply">apply</a></li>
</ul>
</div>
</div>

<div id="outline-container-org2e52c55" class="outline-3">
<h3 id="org2e52c55"><span class="section-number-3">3.7</span> Currying</h3>
<div class="outline-text-3" id="text-3-7">
<p>
Currying 将 <code>f(a,b,c)</code> 转化成 <code>f(a)(b)(c)</code> 这样的调用。一个简单的 curry 实现如
下：
</p>
<div class="org-src-container">
<pre class="src src-js"><span style="color: #859900;">function</span> <span style="color: #b58900;">curry</span>(<span style="color: #6c71c4;">func</span>) {

  <span style="color: #859900;">return</span> <span style="color: #859900;">function</span> curried(...args) {
    <span style="color: #859900;">if</span> (args.length &gt;= func.length) {
      <span style="color: #859900;">return</span> func.apply(<span style="color: #268bd2;">this</span>, args);
    } <span style="color: #859900;">else</span> {
      <span style="color: #859900;">return</span> <span style="color: #859900;">function</span>(...args2) {
        <span style="color: #859900;">return</span> curried.apply(<span style="color: #268bd2;">this</span>, args.concat(args2));
      }
    }
  };

}
</pre>
</div>

<p>
lodash 库提供 <a href="https://lodash.com/docs/4.17.15#curry">_.curry</a> 实现的工具函数
</p>
<div class="org-src-container">
<pre class="src src-js"><span style="color: #859900;">var</span> <span style="color: #6c71c4;">abc</span> = <span style="color: #859900;">function</span>(<span style="color: #6c71c4;">a</span>, <span style="color: #6c71c4;">b</span>, <span style="color: #6c71c4;">c</span>) {
  <span style="color: #859900;">return</span> [a, b, c];
};

<span style="color: #859900;">var</span> <span style="color: #6c71c4;">curried</span> = _.curry(abc);

curried(1)(2)(3);
<span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">=&gt; [1, 2, 3]</span>

curried(1, 2)(3);
<span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">=&gt; [1, 2, 3]</span>

curried(1, 2, 3);
<span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">=&gt; [1, 2, 3]</span>

<span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">Curried with placeholders.</span>
curried(1)(_, 3)(2);
<span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">=&gt; [1, 2, 3]</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgde17c70" class="outline-2">
<h2 id="orgde17c70"><span class="section-number-2">4</span> 标准内置对象</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org20b2423" class="outline-3">
<h3 id="org20b2423"><span class="section-number-3">4.1</span> Number 数字</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-org0bf73b6" class="outline-4">
<h4 id="org0bf73b6"><span class="section-number-4">4.1.1</span> 转化成数字</h4>
<div class="outline-text-4" id="text-4-1-1">
<ul class="org-ul">
<li><code>parseInt(str, base)</code> 转化成整数</li>
<li><code>parseFloat(str)</code> 转化成浮点数</li>
</ul>
</div>
</div>

<div id="outline-container-org6be83df" class="outline-4">
<h4 id="org6be83df"><span class="section-number-4">4.1.2</span> 数字截断</h4>
<div class="outline-text-4" id="text-4-1-2">
<p>
主要有： <code>Math.floor</code> , <code>Math.ceil</code>, <code>Math.round</code>, <code>Math.trunc</code> 这些方法，例
子见下表
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-right">Math.floor</th>
<th scope="col" class="org-right">Math.ceil</th>
<th scope="col" class="org-right">Math.round</th>
<th scope="col" class="org-right">Math.trunc</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">3.1</td>
<td class="org-right">3</td>
<td class="org-right">4</td>
<td class="org-right">3</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-right">3.6</td>
<td class="org-right">3</td>
<td class="org-right">4</td>
<td class="org-right">4</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-right">-1.1</td>
<td class="org-right">-2</td>
<td class="org-right">-1</td>
<td class="org-right">-1</td>
<td class="org-right">-1</td>
</tr>

<tr>
<td class="org-right">-1.6</td>
<td class="org-right">-2</td>
<td class="org-right">-1</td>
<td class="org-right">-2</td>
<td class="org-right">-1</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org9fe7ddd" class="outline-4">
<h4 id="org9fe7ddd"><span class="section-number-4">4.1.3</span> 其它函数</h4>
<div class="outline-text-4" id="text-4-1-3">
<ul class="org-ul">
<li><code>Math.random()</code> 取 0 到 1 之间的随机数</li>
<li><code>Math.max(a, b, c, ..)</code> 和 <code>Math.min(a, b, c, ..)</code> 取最值</li>
<li><code>Math.pow(n, power)</code></li>
</ul>
</div>
</div>

<div id="outline-container-org02f76d1" class="outline-4">
<h4 id="org02f76d1"><span class="section-number-4">4.1.4</span> 特殊数字测试</h4>
<div class="outline-text-4" id="text-4-1-4">
<ul class="org-ul">
<li><code>isFinite</code> 如果不是无穷大，返回真；否则返回假。 <code>Infinity</code> 和 <code>-Infinity</code>
表示无穷大和无穷小</li>
<li><code>isNaN</code> 测试是否是一个数字</li>
</ul>

<div class="org-src-container">
<pre class="src src-js">&gt; isFinite(<span style="color: #268bd2;">NaN</span>)
<span style="color: #268bd2;">false</span>
&gt; isFinite(-<span style="color: #268bd2;">Infinity</span>)
<span style="color: #268bd2;">false</span>
&gt; isFinite(<span style="color: #268bd2;">Infinity</span>)
<span style="color: #268bd2;">false</span>
&gt; isFinite(12)
<span style="color: #268bd2;">true</span>
&gt; isNaN(<span style="color: #268bd2;">NaN</span>)
<span style="color: #268bd2;">true</span>
&gt; isNaN(2)
<span style="color: #268bd2;">false</span>
&gt; isNaN(<span style="color: #2aa198;">"ss"</span>)
<span style="color: #268bd2;">true</span>
&gt;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org94f7e2d" class="outline-3">
<h3 id="org94f7e2d"><span class="section-number-3">4.2</span> String 字符串</h3>
<div class="outline-text-3" id="text-4-2">
<p>
String 对象在 <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String">MDN</a> 中有详细的介绍
</p>
</div>
<div id="outline-container-orge18e59a" class="outline-4">
<h4 id="orge18e59a"><span class="section-number-4">4.2.1</span> 定义字符串</h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
注意使用 <code>${...}</code> 表达式
</p>
<div class="org-src-container">
<pre class="src src-js">&gt; <span style="color: #2aa198;">"Double quote"</span>
<span style="color: #2aa198;">'Double quote'</span>
&gt; <span style="color: #2aa198;">'Single quote'</span>
<span style="color: #2aa198;">'Single quote'</span>
&gt; <span style="color: #859900;">let</span> <span style="color: #6c71c4;">name</span> = <span style="color: #2aa198;">'Jack'</span>
&gt; <span style="color: #2aa198;">`Hi, ${name}`</span>
<span style="color: #2aa198;">'Hi, Jack'</span>
&gt; <span style="color: #2aa198;">`1 + 2 = ${1 + 2}`</span>
<span style="color: #2aa198;">'1 + 2 = 3'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3864a89" class="outline-4">
<h4 id="org3864a89"><span class="section-number-4">4.2.2</span> 字符串长度</h4>
<div class="outline-text-4" id="text-4-2-2">
<p>
<code>str.length</code> ，字符串长度是一个对象中的属性
</p>
<div class="org-src-container">
<pre class="src src-js">&gt; <span style="color: #2aa198;">'hello'</span>.length
5
</pre>
</div>
</div>
</div>

<div id="outline-container-orgce7dc2b" class="outline-4">
<h4 id="orgce7dc2b"><span class="section-number-4">4.2.3</span> 获取子字符串</h4>
<div class="outline-text-4" id="text-4-2-3">
<ul class="org-ul">
<li><code>[]</code> 和 <code>str.charAt(idx)</code>: 通过下标索引获取字符</li>
<li><code>str.slice(beginIndex[,endIndex])</code> 获取子字符串，如果 beginIndex 或
endIndex 是负表示反向索引</li>
<li><code>str.substring(indexStart[,indexEnd])</code> 和 slice 和类似，但是 substring 支
持 indexEnd 小于 indexStart</li>
</ul>
<div class="org-src-container">
<pre class="src src-js">&gt; <span style="color: #2aa198;">'abcd'</span>.substring(1,3)
<span style="color: #2aa198;">'bc'</span>
&gt; <span style="color: #2aa198;">'abcd'</span>.substring(3,1)
<span style="color: #2aa198;">'bc'</span>
&gt; <span style="color: #2aa198;">'abcd'</span>.slice(1,3)
<span style="color: #2aa198;">'bc'</span>
&gt; <span style="color: #2aa198;">'abcd'</span>.slice(3,1)
<span style="color: #2aa198;">''</span>
&gt;
</pre>
</div>
</div>
</div>
