lang/javascript-distilled.org
*** 字符串查找
    - ~str.indexOf(searchValue,fromIndex)~ : 查找字符串中是否包含 searchValue，
      并返回下标
    - ~str.lastIndexOf(searchValue,fromIndex)~ : 反向查找字符串中是否包含
      searchValue，并返回下标
    - ~str.includes(searchString,[position])~ : 查找字符串，返回布尔值
    - ~str.startsWith(searchString[,position])~ 和
      ~str.endsWith(searchString[,length])~
    #+BEGIN_SRC js
      > 'abaa'.indexOf('a')
      0
      > 'abaa'.indexOf('b')
      1
      > 'abaa'.lastIndexOf('a')
      3
      > 'abaa'.includes('b')
      true
      > 'hello'.startsWith('h')
      true
      > 'hello'.startsWith('a')
      false
      > 'hello'.endsWith('a')
      false
      >
    #+END_SRC

*** 字符串替换/正则表达式
    - ~str.replace(regexp|substr,newSubstr|function)~
    - ~str.match(regexp)~ : 匹配 regexp 返回数组，如果 regexp 是 null 则返回空
    - ~str.search(regexp)~
    #+BEGIN_SRC js
      > 'abaa'.replace('a', '$')
      '$baa'
      > 'abaa'.replace(/a/g, '$')
      '$b$$'
      >
    #+END_SRC

    #+BEGIN_SRC js
      > 'abaa'.match(/a/g)
      [ 'a', 'a', 'a' ]
      > 'abaa'.match(/a/)
      [ 'a', index: 0, input: 'abaa', groups: undefined ]
      > 'abaa'.match(/^a/)
      [ 'a', index: 0, input: 'abaa', groups: undefined ]
      > 'For more information, see Chapter 3.4.5.1'.match(/see (chapter \d+(\.\d)*)/i)
      [ 'see Chapter 3.4.5.1',
        'Chapter 3.4.5.1',
        '.1',
        index: 22,
        input: 'For more information, see Chapter 3.4.5.1',
        groups: undefined ]
      > 'abaa'.match(null)
      null
    #+END_SRC

*** 其它字符串函数
    - ~str.padStart()~, ~str.padEnd()~
    - ~str.repeat()~
    - ~str.trim()~, ~str.trimStart()~, ~str.trimEnd()~
    - ~str.toUpperCase()~, ~str.toLowerCase()~
    - ~str.split()~
    #+BEGIN_SRC js
      > 'abaa'.split()
      [ 'abaa' ]
      > 'abaa'.split('')
      [ 'a', 'b', 'a', 'a' ]
    #+END_SRC

** Array 数组
   数组是具有固定长度 (~arr.length~) 的同一类元素的集合，具体参考 [[https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array][MDN]] 中的定义。

*** 创建
    #+BEGIN_SRC js
      > let fruits = ['Apple', 'Banana', 'Orange']
      undefined
      > fruits.length
      3
    #+END_SRC

*** 修改元素：添加/删除
    - ~push(...items)~ : 添加元素到数组结尾
    - ~pop()~ : 移除结尾的元素
    - ~shift()~ : 删除起始的元素
    - ~unshift(...items)~ : 添加元素到数组起始
    #+BEGIN_SRC js
      > fruits
      [ 'Apple', 'Banana', 'Orange' ]
      > fruits.push('Grape')
      4
      > fruits
      [ 'Apple', 'Banana', 'Orange', 'Grape' ]
      > fruits.pop()
      'Grape'
      > fruits
      [ 'Apple', 'Banana', 'Orange' ]
      > fruits.shift()
      'Apple'
      > fruits
      [ 'Banana', 'Orange' ]
      > fruits.unshift('Apple')
      3
      > fruits
      [ 'Apple', 'Banana', 'Orange' ]
      >
    #+END_SRC

    - ~splice(pos, deleteCount, ...items)~ : 在 ~pos~ 位置删除 ~deleteCount~ 个元
      素然后插入 ~items~
    - ~slice(start, end)~ : 创建一个新的数组, 复制 ~start~ 到 ~end~ (不包含) 到新
      的数组中
    - ~concat(...items)~ : 返回一个新的数组: 拷贝当前数组的所有元素然后添加
      ~items~ 到新的数组中. 如果任何 ~items~ 是一个数组, 数组里面的元素都会添加的
      新的数组中
    #+BEGIN_SRC js
      > fruits
      [ 'Apple', 'Banana', 'Orange' ]
      > let new_fruits = fruits.slice(0, 2)
      > new_fruits
      [ 'Apple', 'Banana' ]
      > fruits.splice(1, 1)
      [ 'Banana' ]
      > fruits
      [ 'Apple', 'Orange' ]
      > fruits
      [ 'Apple', 'Orange' ]
      > fruits.splice(1, 0, 'Pear')
      []
      > fruits
      [ 'Apple', 'Pear', 'Orange' ]
      > fruits.concat('Banana')
      [ 'Apple', 'Pear', 'Orange', 'Banana' ]
      > fruits
      [ 'Apple', 'Pear', 'Orange' ]
      >
    #+END_SRC

*** 查找
    - ~indexOf/lastIndexOf(item, pos)~ : 查找 ~item~ , 起始位置是~pos~ , 如果没有
      找到则返回 ~-1~
    - ~includes(value)~ : 返回 ~true~ 如果数组包含 ~value~ , 否则 ~false~
    - ~find/filter(func)~ : 使用谓词函数过滤数组, 返回第一个/所有的使得谓词函数成
      立的元素
    - ~findIndex(func)~ : 和 ~find~ 相似, 但是返回下标索引而不是数组元素
    #+BEGIN_SRC js
      > fruits
      [ 'Apple', 'Pear', 'Orange' ]
      > fruits.indexOf('Pear')
      1
      > fruits.indexOf('Banana')
      -1
      > fruits.find(function (e) { return e.length >= 5;})
      'Apple'
      > fruits.filter(function (e) { return e.length >= 5;})
      [ 'Apple', 'Orange' ]
      > fruits.includes('Banana')
      false
      > fruits.includes('Pear')
      true
      > 'Banana' in fruits
      false
      > 'Pear' in fruits
      false
    #+END_SRC

