lang/javascript-distilled.html

<div id="outline-container-orgb220657" class="outline-4">
<h4 id="orgb220657"><span class="section-number-4">4.2.4</span> 字符串查找</h4>
<div class="outline-text-4" id="text-4-2-4">
<ul class="org-ul">
<li><code>str.indexOf(searchValue,fromIndex)</code> : 查找字符串中是否包含 searchValue，
并返回下标</li>
<li><code>str.lastIndexOf(searchValue,fromIndex)</code> : 反向查找字符串中是否包含
searchValue，并返回下标</li>
<li><code>str.includes(searchString,[position])</code> : 查找字符串，返回布尔值</li>
<li><code>str.startsWith(searchString[,position])</code> 和
<code>str.endsWith(searchString[,length])</code></li>
</ul>
<div class="org-src-container">
<pre class="src src-js">&gt; <span style="color: #2aa198;">'abaa'</span>.indexOf(<span style="color: #2aa198;">'a'</span>)
0
&gt; <span style="color: #2aa198;">'abaa'</span>.indexOf(<span style="color: #2aa198;">'b'</span>)
1
&gt; <span style="color: #2aa198;">'abaa'</span>.lastIndexOf(<span style="color: #2aa198;">'a'</span>)
3
&gt; <span style="color: #2aa198;">'abaa'</span>.includes(<span style="color: #2aa198;">'b'</span>)
<span style="color: #268bd2;">true</span>
&gt; <span style="color: #2aa198;">'hello'</span>.startsWith(<span style="color: #2aa198;">'h'</span>)
<span style="color: #268bd2;">true</span>
&gt; <span style="color: #2aa198;">'hello'</span>.startsWith(<span style="color: #2aa198;">'a'</span>)
<span style="color: #268bd2;">false</span>
&gt; <span style="color: #2aa198;">'hello'</span>.endsWith(<span style="color: #2aa198;">'a'</span>)
<span style="color: #268bd2;">false</span>
&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-orge963c20" class="outline-4">
<h4 id="orge963c20"><span class="section-number-4">4.2.5</span> 字符串替换/正则表达式</h4>
<div class="outline-text-4" id="text-4-2-5">
<ul class="org-ul">
<li><code>str.replace(regexp|substr,newSubstr|function)</code></li>
<li><code>str.match(regexp)</code> : 匹配 regexp 返回数组，如果 regexp 是 null 则返回空</li>
<li><code>str.search(regexp)</code></li>
</ul>
<div class="org-src-container">
<pre class="src src-js">&gt; <span style="color: #2aa198;">'abaa'</span>.replace(<span style="color: #2aa198;">'a'</span>, <span style="color: #2aa198;">'$'</span>)
<span style="color: #2aa198;">'$baa'</span>
&gt; <span style="color: #2aa198;">'abaa'</span>.replace(<span style="color: #2aa198;">/a/</span>g, <span style="color: #2aa198;">'$'</span>)
<span style="color: #2aa198;">'$b$$'</span>
&gt;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-js">&gt; <span style="color: #2aa198;">'abaa'</span>.match(<span style="color: #2aa198;">/a/</span>g)
[ <span style="color: #2aa198;">'a'</span>, <span style="color: #2aa198;">'a'</span>, <span style="color: #2aa198;">'a'</span> ]
&gt; <span style="color: #2aa198;">'abaa'</span>.match(<span style="color: #2aa198;">/a/</span>)
[ <span style="color: #2aa198;">'a'</span>, index: 0, input: <span style="color: #2aa198;">'abaa'</span>, groups: <span style="color: #268bd2;">undefined</span> ]
&gt; <span style="color: #2aa198;">'abaa'</span>.match(<span style="color: #2aa198;">/^a/</span>)
[ <span style="color: #2aa198;">'a'</span>, index: 0, input: <span style="color: #2aa198;">'abaa'</span>, groups: <span style="color: #268bd2;">undefined</span> ]
&gt; <span style="color: #2aa198;">'For more information, see Chapter 3.4.5.1'</span>.match(<span style="color: #2aa198;">/see (chapter \d+(\.\d)*)/</span>i)
[ <span style="color: #2aa198;">'see Chapter 3.4.5.1'</span>,
  <span style="color: #2aa198;">'Chapter 3.4.5.1'</span>,
  <span style="color: #2aa198;">'.1'</span>,
  index: 22,
  input: <span style="color: #2aa198;">'For more information, see Chapter 3.4.5.1'</span>,
  groups: <span style="color: #268bd2;">undefined</span> ]
&gt; <span style="color: #2aa198;">'abaa'</span>.match(<span style="color: #268bd2;">null</span>)
<span style="color: #268bd2;">null</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org331395a" class="outline-4">
<h4 id="org331395a"><span class="section-number-4">4.2.6</span> 其它字符串函数</h4>
<div class="outline-text-4" id="text-4-2-6">
<ul class="org-ul">
<li><code>str.padStart()</code>, <code>str.padEnd()</code></li>
<li><code>str.repeat()</code></li>
<li><code>str.trim()</code>, <code>str.trimStart()</code>, <code>str.trimEnd()</code></li>
<li><code>str.toUpperCase()</code>, <code>str.toLowerCase()</code></li>
<li><code>str.split()</code></li>
</ul>
<div class="org-src-container">
<pre class="src src-js">&gt; <span style="color: #2aa198;">'abaa'</span>.split()
[ <span style="color: #2aa198;">'abaa'</span> ]
&gt; <span style="color: #2aa198;">'abaa'</span>.split(<span style="color: #2aa198;">''</span>)
[ <span style="color: #2aa198;">'a'</span>, <span style="color: #2aa198;">'b'</span>, <span style="color: #2aa198;">'a'</span>, <span style="color: #2aa198;">'a'</span> ]
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgfae7227" class="outline-3">
<h3 id="orgfae7227"><span class="section-number-3">4.3</span> Array 数组</h3>
<div class="outline-text-3" id="text-4-3">
<p>
数组是具有固定长度 (<code>arr.length</code>) 的同一类元素的集合，具体参考 <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array">MDN</a> 中的定义。
</p>
</div>

<div id="outline-container-orga5fbdd9" class="outline-4">
<h4 id="orga5fbdd9"><span class="section-number-4">4.3.1</span> 创建</h4>
<div class="outline-text-4" id="text-4-3-1">
<div class="org-src-container">
<pre class="src src-js">&gt; <span style="color: #859900;">let</span> <span style="color: #6c71c4;">fruits</span> = [<span style="color: #2aa198;">'Apple'</span>, <span style="color: #2aa198;">'Banana'</span>, <span style="color: #2aa198;">'Orange'</span>]
<span style="color: #268bd2;">undefined</span>
&gt; fruits.length
3
</pre>
</div>
</div>
</div>

<div id="outline-container-org385e2be" class="outline-4">
<h4 id="org385e2be"><span class="section-number-4">4.3.2</span> 修改元素：添加/删除</h4>
<div class="outline-text-4" id="text-4-3-2">
<ul class="org-ul">
<li><code>push(...items)</code> : 添加元素到数组结尾</li>
<li><code>pop()</code> : 移除结尾的元素</li>
<li><code>shift()</code> : 删除起始的元素</li>
<li><code>unshift(...items)</code> : 添加元素到数组起始</li>
</ul>
<div class="org-src-container">
<pre class="src src-js">&gt; fruits
[ <span style="color: #2aa198;">'Apple'</span>, <span style="color: #2aa198;">'Banana'</span>, <span style="color: #2aa198;">'Orange'</span> ]
&gt; fruits.push(<span style="color: #2aa198;">'Grape'</span>)
4
&gt; fruits
[ <span style="color: #2aa198;">'Apple'</span>, <span style="color: #2aa198;">'Banana'</span>, <span style="color: #2aa198;">'Orange'</span>, <span style="color: #2aa198;">'Grape'</span> ]
&gt; fruits.pop()
<span style="color: #2aa198;">'Grape'</span>
&gt; fruits
[ <span style="color: #2aa198;">'Apple'</span>, <span style="color: #2aa198;">'Banana'</span>, <span style="color: #2aa198;">'Orange'</span> ]
&gt; fruits.shift()
<span style="color: #2aa198;">'Apple'</span>
&gt; fruits
[ <span style="color: #2aa198;">'Banana'</span>, <span style="color: #2aa198;">'Orange'</span> ]
&gt; fruits.unshift(<span style="color: #2aa198;">'Apple'</span>)
3
&gt; fruits
[ <span style="color: #2aa198;">'Apple'</span>, <span style="color: #2aa198;">'Banana'</span>, <span style="color: #2aa198;">'Orange'</span> ]
&gt;
</pre>
</div>

<ul class="org-ul">
<li><code>splice(pos, deleteCount, ...items)</code> : 在 <code>pos</code> 位置删除 <code>deleteCount</code> 个元
素然后插入 <code>items</code></li>
<li><code>slice(start, end)</code> : 创建一个新的数组, 复制 <code>start</code> 到 <code>end</code> (不包含) 到新
的数组中</li>
<li><code>concat(...items)</code> : 返回一个新的数组: 拷贝当前数组的所有元素然后添加
<code>items</code> 到新的数组中. 如果任何 <code>items</code> 是一个数组, 数组里面的元素都会添加的
新的数组中</li>
</ul>
<div class="org-src-container">
<pre class="src src-js">&gt; fruits
[ <span style="color: #2aa198;">'Apple'</span>, <span style="color: #2aa198;">'Banana'</span>, <span style="color: #2aa198;">'Orange'</span> ]
&gt; <span style="color: #859900;">let</span> <span style="color: #6c71c4;">new_fruits</span> = fruits.slice(0, 2)
&gt; new_fruits
[ <span style="color: #2aa198;">'Apple'</span>, <span style="color: #2aa198;">'Banana'</span> ]
&gt; fruits.splice(1, 1)
[ <span style="color: #2aa198;">'Banana'</span> ]
&gt; fruits
[ <span style="color: #2aa198;">'Apple'</span>, <span style="color: #2aa198;">'Orange'</span> ]
&gt; fruits
[ <span style="color: #2aa198;">'Apple'</span>, <span style="color: #2aa198;">'Orange'</span> ]
&gt; fruits.splice(1, 0, <span style="color: #2aa198;">'Pear'</span>)
[]
&gt; fruits
[ <span style="color: #2aa198;">'Apple'</span>, <span style="color: #2aa198;">'Pear'</span>, <span style="color: #2aa198;">'Orange'</span> ]
&gt; fruits.concat(<span style="color: #2aa198;">'Banana'</span>)
[ <span style="color: #2aa198;">'Apple'</span>, <span style="color: #2aa198;">'Pear'</span>, <span style="color: #2aa198;">'Orange'</span>, <span style="color: #2aa198;">'Banana'</span> ]
&gt; fruits
[ <span style="color: #2aa198;">'Apple'</span>, <span style="color: #2aa198;">'Pear'</span>, <span style="color: #2aa198;">'Orange'</span> ]
&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org4ef8a6b" class="outline-4">
<h4 id="org4ef8a6b"><span class="section-number-4">4.3.3</span> 查找</h4>
<div class="outline-text-4" id="text-4-3-3">
<ul class="org-ul">
<li><code>indexOf/lastIndexOf(item, pos)</code> : 查找 <code>item</code> , 起始位置是~pos~ , 如果没有
找到则返回 <code>-1</code></li>
<li><code>includes(value)</code> : 返回 <code>true</code> 如果数组包含 <code>value</code> , 否则 <code>false</code></li>
<li><code>find/filter(func)</code> : 使用谓词函数过滤数组, 返回第一个/所有的使得谓词函数成
立的元素</li>
<li><code>findIndex(func)</code> : 和 <code>find</code> 相似, 但是返回下标索引而不是数组元素</li>
</ul>
<div class="org-src-container">
<pre class="src src-js">&gt; fruits
[ <span style="color: #2aa198;">'Apple'</span>, <span style="color: #2aa198;">'Pear'</span>, <span style="color: #2aa198;">'Orange'</span> ]
&gt; fruits.indexOf(<span style="color: #2aa198;">'Pear'</span>)
1
&gt; fruits.indexOf(<span style="color: #2aa198;">'Banana'</span>)
-1
&gt; fruits.find(<span style="color: #859900;">function</span> (<span style="color: #6c71c4;">e</span>) { <span style="color: #859900;">return</span> e.length &gt;= 5;})
<span style="color: #2aa198;">'Apple'</span>
&gt; fruits.filter(<span style="color: #859900;">function</span> (<span style="color: #6c71c4;">e</span>) { <span style="color: #859900;">return</span> e.length &gt;= 5;})
[ <span style="color: #2aa198;">'Apple'</span>, <span style="color: #2aa198;">'Orange'</span> ]
&gt; fruits.includes(<span style="color: #2aa198;">'Banana'</span>)
<span style="color: #268bd2;">false</span>
&gt; fruits.includes(<span style="color: #2aa198;">'Pear'</span>)
<span style="color: #268bd2;">true</span>
&gt; <span style="color: #2aa198;">'Banana'</span> <span style="color: #859900;">in</span> fruits
<span style="color: #268bd2;">false</span>
&gt; <span style="color: #2aa198;">'Pear'</span> <span style="color: #859900;">in</span> fruits
<span style="color: #268bd2;">false</span>
</pre>
</div>
</div>
</div>
