lang/javascript-distilled.org
*** 迭代
    - ~forEach(func)~ : 调用 ~func~ 处理所有的数组里的元素, 但是不返回
    #+BEGIN_SRC js
      ['Apple', 'Banana', 'Orange'].forEach(function(e, i, arr) {
        console.log(i + " : " + e)
      })
    #+END_SRC

*** 数组变换
    - ~map(func)~ : 调用 ~func~ 处理所有数组里的元素，返回处理结果集构成的新数组
    - ~sort(func)~ : 使用 ~func~ 排序数组，然后返回
    - ~reverse()~ : 返回逆序的数组
    - ~split/join~ : 在字符串和数组之间转换
    - ~reduce(func, initial)~ : 计算得出一个值， 通过调用 ~func~ 函数处理起始值和
      中间值
    #+BEGIN_SRC js
      > fruits
      [ 'Apple', 'Pear', 'Orange' ]
      > fruits.map(function(e) { return e.toUpperCase();})
      [ 'APPLE', 'PEAR', 'ORANGE' ]
      > fruits.reduce(function(a, e) { return a+':'+e;}, '')
      ':Apple:Pear:Orange'
      > fruits.join(':')
      'Apple:Pear:Orange'
      > 'Apple:Pear:Orange'.split(':')
      [ 'Apple', 'Pear', 'Orange' ]
      > fruits.sort()
      [ 'Apple', 'Orange', 'Pear' ]
      > fruits
      [ 'Apple', 'Orange', 'Pear' ]
      > fruits.sort(function(a,b) {return a.length>b.length?1:-1;})
      [ 'Pear', 'Apple', 'Orange' ]
      > fruits.reverse()
      [ 'Orange', 'Apple', 'Pear' ]
      >
    #+END_SRC

*** 其它
    - ~Array.isArray(arr)~ : 检查 ~arr~ 是否是数组对象
    - ~arr.some(fn)~ / ~arr.every(fn)~ : 调用 ~fn~ 作用于数组所有元素，如果任何/
      所有的都返回 ~true~, 则返回 ~true~, 否则返回 ~false~
    - ~arr.fill(value, start, end)~ : 使用 ~value~ 填充数组 ~start~ 到 ~end~ 位置
      的元素
    - ~arr.copyWithin(target, start, end)~ : 复制数组 ~start~ 到 ~end~ 位置中的元
      素到自身 ~target~ 位置中, 注意会覆盖已存在的元素

** 迭代器/数组类似物
*** Array-like 和 Iterable
    - =Iterable= 是实现了 =Symbol.iterator= 方法的对象
      + =Symbol.iterator= 必须包含 =next()= 方法
      + =next()= 方法必须返回像 ~{done: Boolean, value: any}~ 这样的对象，done 为
        ~true~ 表示迭代器结束
      + =Iterable= 主要是使用 =for..of= 迭代器进行迭代
    - =Array-like= 是含义 =length= 属性和可索引的对象

    #+BEGIN_SRC js
      let arrayLike = { // has indexes and length => array-like
        0: "Hello",
        1: "World",
        length: 2
      };

      let iterable = {
        from: 1,
        to: 5,
        // 1. call to for..of initially calls this
        [Symbol.iterator]() {
          this.current = this.from;
          // 2. ...it returns the iterator:
          return this;
        },
        // 3. next() is called on each iteration by the for..of loop
        next() {
          // 4. it should return the value as an object {done:.., value :...}
          if (this.current <= this.to) {
            return { done: false, value: this.current++ };
          } else {
            return { done: true };
          }
        }
        }
      }

      for (let num of iterable) { console.log(num); } // => prints 1, 2, 3, 4, 5
    #+END_SRC

*** ~Array.from~
    ~Array.from(arrayLike[,mapFn[,thisArg]])~ 通过 Array-like 的对象来新建一个真
    的 Array，例如字符串 ~'foo'~ 是 Array-like 对象，因此可以建立一个新的数组
    #+BEGIN_SRC js
      > Array.from('foo');
      [ 'f', 'o', 'o' ]
    #+END_SRC

