lang/javascript-distilled.html

<div id="outline-container-orgc7e727f" class="outline-4">
<h4 id="orgc7e727f"><span class="section-number-4">4.3.4</span> 迭代</h4>
<div class="outline-text-4" id="text-4-3-4">
<ul class="org-ul">
<li><code>forEach(func)</code> : 调用 <code>func</code> 处理所有的数组里的元素, 但是不返回</li>
</ul>
<div class="org-src-container">
<pre class="src src-js">[<span style="color: #2aa198;">'Apple'</span>, <span style="color: #2aa198;">'Banana'</span>, <span style="color: #2aa198;">'Orange'</span>].forEach(<span style="color: #859900;">function</span>(<span style="color: #6c71c4;">e</span>, <span style="color: #6c71c4;">i</span>, <span style="color: #6c71c4;">arr</span>) {
  console.log(i + <span style="color: #2aa198;">" : "</span> + e)
})
</pre>
</div>
</div>
</div>

<div id="outline-container-org12d0d9e" class="outline-4">
<h4 id="org12d0d9e"><span class="section-number-4">4.3.5</span> 数组变换</h4>
<div class="outline-text-4" id="text-4-3-5">
<ul class="org-ul">
<li><code>map(func)</code> : 调用 <code>func</code> 处理所有数组里的元素，返回处理结果集构成的新数组</li>
<li><code>sort(func)</code> : 使用 <code>func</code> 排序数组，然后返回</li>
<li><code>reverse()</code> : 返回逆序的数组</li>
<li><code>split/join</code> : 在字符串和数组之间转换</li>
<li><code>reduce(func, initial)</code> : 计算得出一个值， 通过调用 <code>func</code> 函数处理起始值和
中间值</li>
</ul>
<div class="org-src-container">
<pre class="src src-js">&gt; fruits
[ <span style="color: #2aa198;">'Apple'</span>, <span style="color: #2aa198;">'Pear'</span>, <span style="color: #2aa198;">'Orange'</span> ]
&gt; fruits.map(<span style="color: #859900;">function</span>(<span style="color: #6c71c4;">e</span>) { <span style="color: #859900;">return</span> e.toUpperCase();})
[ <span style="color: #2aa198;">'APPLE'</span>, <span style="color: #2aa198;">'PEAR'</span>, <span style="color: #2aa198;">'ORANGE'</span> ]
&gt; fruits.reduce(<span style="color: #859900;">function</span>(<span style="color: #6c71c4;">a</span>, <span style="color: #6c71c4;">e</span>) { <span style="color: #859900;">return</span> a+<span style="color: #2aa198;">':'</span>+e;}, <span style="color: #2aa198;">''</span>)
<span style="color: #2aa198;">':Apple:Pear:Orange'</span>
&gt; fruits.join(<span style="color: #2aa198;">':'</span>)
<span style="color: #2aa198;">'Apple:Pear:Orange'</span>
&gt; <span style="color: #2aa198;">'Apple:Pear:Orange'</span>.split(<span style="color: #2aa198;">':'</span>)
[ <span style="color: #2aa198;">'Apple'</span>, <span style="color: #2aa198;">'Pear'</span>, <span style="color: #2aa198;">'Orange'</span> ]
&gt; fruits.sort()
[ <span style="color: #2aa198;">'Apple'</span>, <span style="color: #2aa198;">'Orange'</span>, <span style="color: #2aa198;">'Pear'</span> ]
&gt; fruits
[ <span style="color: #2aa198;">'Apple'</span>, <span style="color: #2aa198;">'Orange'</span>, <span style="color: #2aa198;">'Pear'</span> ]
&gt; fruits.sort(<span style="color: #859900;">function</span>(<span style="color: #6c71c4;">a</span>,<span style="color: #6c71c4;">b</span>) {<span style="color: #859900;">return</span> a.length&gt;b.length?1:-1;})
[ <span style="color: #2aa198;">'Pear'</span>, <span style="color: #2aa198;">'Apple'</span>, <span style="color: #2aa198;">'Orange'</span> ]
&gt; fruits.reverse()
[ <span style="color: #2aa198;">'Orange'</span>, <span style="color: #2aa198;">'Apple'</span>, <span style="color: #2aa198;">'Pear'</span> ]
&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc60c08b" class="outline-4">
<h4 id="orgc60c08b"><span class="section-number-4">4.3.6</span> 其它</h4>
<div class="outline-text-4" id="text-4-3-6">
<ul class="org-ul">
<li><code>Array.isArray(arr)</code> : 检查 <code>arr</code> 是否是数组对象</li>
<li><code>arr.some(fn)</code> / <code>arr.every(fn)</code> : 调用 <code>fn</code> 作用于数组所有元素，如果任何/
所有的都返回 <code>true</code>, 则返回 <code>true</code>, 否则返回 <code>false</code></li>
<li><code>arr.fill(value, start, end)</code> : 使用 <code>value</code> 填充数组 <code>start</code> 到 <code>end</code> 位置
的元素</li>
<li><code>arr.copyWithin(target, start, end)</code> : 复制数组 <code>start</code> 到 <code>end</code> 位置中的元
素到自身 <code>target</code> 位置中, 注意会覆盖已存在的元素</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orga7aa9ff" class="outline-3">
<h3 id="orga7aa9ff"><span class="section-number-3">4.4</span> 迭代器/数组类似物</h3>
<div class="outline-text-3" id="text-4-4">
</div>
<div id="outline-container-orgf1d7bab" class="outline-4">
<h4 id="orgf1d7bab"><span class="section-number-4">4.4.1</span> Array-like 和 Iterable</h4>
<div class="outline-text-4" id="text-4-4-1">
<ul class="org-ul">
<li><code>Iterable</code> 是实现了 <code>Symbol.iterator</code> 方法的对象
<ul class="org-ul">
<li><code>Symbol.iterator</code> 必须包含 <code>next()</code> 方法</li>
<li><code>next()</code> 方法必须返回像 <code>{done: Boolean, value: any}</code> 这样的对象，done 为
<code>true</code> 表示迭代器结束</li>
<li><code>Iterable</code> 主要是使用 <code>for..of</code> 迭代器进行迭代</li>
</ul></li>
<li><code>Array-like</code> 是含义 <code>length</code> 属性和可索引的对象</li>
</ul>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #859900;">let</span> <span style="color: #6c71c4;">arrayLike</span> = { <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">has indexes and length =&gt; array-like</span>
  0: <span style="color: #2aa198;">"Hello"</span>,
  1: <span style="color: #2aa198;">"World"</span>,
  length: 2
};

<span style="color: #859900;">let</span> <span style="color: #6c71c4;">iterable</span> = {
  from: 1,
  to: 5,
  <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">1. call to for..of initially calls this</span>
  [Symbol.iterator]() {
    <span style="color: #268bd2;">this</span>.current = <span style="color: #268bd2;">this</span>.from;
    <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">2. ...it returns the iterator:</span>
    <span style="color: #859900;">return</span> <span style="color: #268bd2;">this</span>;
  },
  <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">3. next() is called on each iteration by the for..of loop</span>
  next() {
    <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">4. it should return the value as an object {done:.., value :...}</span>
    <span style="color: #859900;">if</span> (<span style="color: #268bd2;">this</span>.current &lt;= <span style="color: #268bd2;">this</span>.to) {
      <span style="color: #859900;">return</span> { done: <span style="color: #268bd2;">false</span>, value: <span style="color: #268bd2;">this</span>.current++ };
    } <span style="color: #859900;">else</span> {
      <span style="color: #859900;">return</span> { done: <span style="color: #268bd2;">true</span> };
    }
  }
  }
}

<span style="color: #859900;">for</span> (<span style="color: #859900;">let</span> <span style="color: #6c71c4;">num</span> of iterable) { console.log(num); } <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">=&gt; prints 1, 2, 3, 4, 5</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org880a7bb" class="outline-4">
<h4 id="org880a7bb"><span class="section-number-4">4.4.2</span> <code>Array.from</code></h4>
<div class="outline-text-4" id="text-4-4-2">
<p>
<code>Array.from(arrayLike[,mapFn[,thisArg]])</code> 通过 Array-like 的对象来新建一个真
的 Array，例如字符串 <code>'foo'</code> 是 Array-like 对象，因此可以建立一个新的数组
</p>
<div class="org-src-container">
<pre class="src src-js">&gt; Array.from(<span style="color: #2aa198;">'foo'</span>);
[ <span style="color: #2aa198;">'f'</span>, <span style="color: #2aa198;">'o'</span>, <span style="color: #2aa198;">'o'</span> ]
</pre>
</div>
</div>
</div>
</div>
