lang/javascript-distilled.html

<div id="outline-container-org51f6e06" class="outline-3">
<h3 id="org51f6e06"><span class="section-number-3">4.5</span> Map/Set 等标准内置对象</h3>
<div class="outline-text-3" id="text-4-5">
<p>
<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Map">Map</a> , WeakMap, <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Set">Set</a>, WeakSet 等都是常用的 Javascript 对象，具体参考 MDN 中的定
义 <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects"> Standard built-in objects</a>
</p>

<p>
Map 对象操作
</p>
<div class="org-src-container">
<pre class="src src-js"><span style="color: #859900;">let</span> <span style="color: #6c71c4;">map</span> = <span style="color: #859900;">new</span> <span style="color: #268bd2;">Map</span>();

map.set(<span style="color: #2aa198;">'1'</span>, <span style="color: #2aa198;">'str1'</span>);   <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">a string key</span>
map.set(1, <span style="color: #2aa198;">'num1'</span>);     <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">a numeric key</span>
map.set(<span style="color: #268bd2;">true</span>, <span style="color: #2aa198;">'bool1'</span>); <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">a boolean key</span>

<span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">remember the regular Object? it would convert keys to string</span>
<span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">Map keeps the type, so these two are different:</span>
alert( map.get(1)   ); <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">'num1'</span>
alert( map.get(<span style="color: #2aa198;">'1'</span>) ); <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">'str1'</span>

alert( map.size ); <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">3</span>

<span style="color: #859900;">let</span> <span style="color: #6c71c4;">recipeMap</span> = <span style="color: #859900;">new</span> <span style="color: #268bd2;">Map</span>([
  [<span style="color: #2aa198;">'cucumber'</span>, 500],
  [<span style="color: #2aa198;">'tomatoes'</span>, 350],
  [<span style="color: #2aa198;">'onion'</span>,    50]
]);

<span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">iterate over keys (vegetables)</span>
<span style="color: #859900;">for</span> (<span style="color: #859900;">let</span> <span style="color: #6c71c4;">vegetable</span> of recipeMap.keys()) {
  alert(vegetable); <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">cucumber, tomatoes, onion</span>
}

<span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">iterate over values (amounts)</span>
<span style="color: #859900;">for</span> (<span style="color: #859900;">let</span> <span style="color: #6c71c4;">amount</span> of recipeMap.values()) {
  alert(amount); <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">500, 350, 50</span>
}

<span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">iterate over [key, value] entries</span>
<span style="color: #859900;">for</span> (<span style="color: #859900;">let</span> <span style="color: #6c71c4;">entry</span> of recipeMap) { <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">the same as of recipeMap.entries()</span>
  alert(entry); <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">cucumber,500 (and so on)</span>
}
</pre>
</div>

<p>
Set 集合函数
</p>
<div class="org-src-container">
<pre class="src src-js"><span style="color: #859900;">let</span> <span style="color: #6c71c4;">set</span> = <span style="color: #859900;">new</span> <span style="color: #268bd2;">Set</span>();

<span style="color: #859900;">let</span> <span style="color: #6c71c4;">john</span> = { name: <span style="color: #2aa198;">"John"</span> };
<span style="color: #859900;">let</span> <span style="color: #6c71c4;">pete</span> = { name: <span style="color: #2aa198;">"Pete"</span> };
<span style="color: #859900;">let</span> <span style="color: #6c71c4;">mary</span> = { name: <span style="color: #2aa198;">"Mary"</span> };

<span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">visits, some users come multiple times</span>
set.add(john);
set.add(pete);
set.add(mary);
set.add(john);
set.add(mary);

<span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">set keeps only unique values</span>
alert( set.size ); <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">3</span>

<span style="color: #859900;">for</span> (<span style="color: #859900;">let</span> <span style="color: #6c71c4;">user</span> of set) {
  alert(user.name); <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">John (then Pete and Mary)</span>
}

<span style="color: #859900;">let</span> <span style="color: #6c71c4;">set</span> = <span style="color: #859900;">new</span> <span style="color: #268bd2;">Set</span>([<span style="color: #2aa198;">"oranges"</span>, <span style="color: #2aa198;">"apples"</span>, <span style="color: #2aa198;">"bananas"</span>]);

<span style="color: #859900;">for</span> (<span style="color: #859900;">let</span> <span style="color: #6c71c4;">value</span> of set) alert(value);

<span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">the same with forEach:</span>
set.forEach((value, valueAgain, set) =&gt; {
  alert(value);
});
</pre>
</div>
</div>
</div>

<div id="outline-container-org151bda0" class="outline-3">
<h3 id="org151bda0"><span class="section-number-3">4.6</span> Object 对象</h3>
<div class="outline-text-3" id="text-4-6">
<p>
<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object">Object</a> 是 JavaScript 中的对象
</p>
</div>

<div id="outline-container-org47099df" class="outline-4">
<h4 id="org47099df"><span class="section-number-4">4.6.1</span> 定义对象</h4>
<div class="outline-text-4" id="text-4-6-1">
<div class="org-src-container">
<pre class="src src-js">&gt; <span style="color: #859900;">let</span> <span style="color: #6c71c4;">user1</span> = <span style="color: #859900;">new</span> <span style="color: #268bd2;">Object</span>()
&gt; user1
{}
&gt; <span style="color: #859900;">let</span> <span style="color: #6c71c4;">user2</span> = {}
&gt; user2
{}
&gt; <span style="color: #859900;">let</span> <span style="color: #6c71c4;">user3</span> = {name: <span style="color: #2aa198;">'Tom'</span>, age: 22}
&gt; user3
{ name: <span style="color: #2aa198;">'Tom'</span>, age: 22 }
&gt; user3.name
<span style="color: #2aa198;">'Tom'</span>
&gt; user3[<span style="color: #2aa198;">'name'</span>]
<span style="color: #2aa198;">'Tom'</span>
&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf937c97" class="outline-4">
<h4 id="orgf937c97"><span class="section-number-4">4.6.2</span> 对象基本操作</h4>
<div class="outline-text-4" id="text-4-6-2">
<ul class="org-ul">
<li>引用对象中的值
<ul class="org-ul">
<li>点方式： <code>obj.key</code></li>
<li>方括号方式： <code>obj['key']</code></li>
</ul></li>
<li>删除对象中的值 <code>delete obj.key</code></li>
<li>判断对象中是否存在键 <code>'key' in obj</code></li>
</ul>
<div class="org-src-container">
<pre class="src src-js"><span style="color: #859900;">let</span> <span style="color: #6c71c4;">usr</span> = {name: <span style="color: #2aa198;">'Tom'</span>, age: 22}
&gt; <span style="color: #2aa198;">'name'</span> <span style="color: #859900;">in</span> usr
<span style="color: #268bd2;">true</span>
&gt; <span style="color: #2aa198;">'birthday'</span> <span style="color: #859900;">in</span> usr
<span style="color: #268bd2;">false</span>
&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org5c47be9" class="outline-4">
<h4 id="org5c47be9"><span class="section-number-4">4.6.3</span> 对象引用/复制</h4>
<div class="outline-text-4" id="text-4-6-3">
<p>
<code>=</code> 赋值是引用
</p>
<div class="org-src-container">
<pre class="src src-js">&gt; obj1 = {a:<span style="color: #2aa198;">'Apple'</span>, b:1}
{ a: <span style="color: #2aa198;">'Apple'</span>, b: 1 }
&gt; obj2 = obj1
{ a: <span style="color: #2aa198;">'Apple'</span>, b: 1 }
&gt; obj2.b = 7
7
&gt; obj1
{ a: <span style="color: #2aa198;">'Apple'</span>, b: 7 }
&gt;
</pre>
</div>

<p>
<code>Object.assign(...)</code> 可以实现复制传值，或者使用 lodash 库中的
<a href="https://lodash.com/docs#cloneDeep">_.cloneDeep(obj)</a>
</p>
<div class="org-src-container">
<pre class="src src-js">&gt; obj3 = Object.assign({}, obj1)
{ a: <span style="color: #2aa198;">'Apple'</span>, b: 7 }
&gt; obj3.b = 9
9
&gt; obj1
{ a: <span style="color: #2aa198;">'Apple'</span>, b: 7 }
&gt;
</pre>
</div>

<p>
下面是更多的传值的示例
</p>
<div class="org-src-container">
<pre class="src src-js">&gt; usr
{ name: <span style="color: #2aa198;">'Tom'</span>, age: 22, foo: <span style="color: #268bd2;">undefined</span> }
&gt; usr1 = usr
{ name: <span style="color: #2aa198;">'Tom'</span>, age: 22, foo: <span style="color: #268bd2;">undefined</span> }
&gt; usr1 == usr
<span style="color: #268bd2;">true</span>
&gt; usr1 === usr
<span style="color: #268bd2;">true</span>
&gt; <span style="color: #859900;">let</span> <span style="color: #6c71c4;">_usr</span> = {}
&gt; <span style="color: #859900;">for</span> (k <span style="color: #859900;">in</span> usr) { _usr[k] = usr[k]; }
&gt; _usr
{ name: <span style="color: #2aa198;">'Tom'</span>, age: 22, foo: <span style="color: #268bd2;">undefined</span> }
&gt; _usr == usr
<span style="color: #268bd2;">false</span>
&gt; _usr === usr
<span style="color: #268bd2;">false</span>
&gt; usr
{ name: <span style="color: #2aa198;">'Jackson'</span>, age: 22, foo: <span style="color: #268bd2;">undefined</span> }
&gt; <span style="color: #859900;">delete</span> usr.foo
<span style="color: #268bd2;">true</span>
&gt; usr
{ name: <span style="color: #2aa198;">'Jackson'</span>, age: 22 }
&gt; <span style="color: #2aa198;">'foo'</span> <span style="color: #859900;">in</span> usr
<span style="color: #268bd2;">false</span>
&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org8026d98" class="outline-4">
<h4 id="org8026d98"><span class="section-number-4">4.6.4</span> 更新对象</h4>
<div class="outline-text-4" id="text-4-6-4">
<p>
<code>Object.assign(dest[, src1, src2, src3...])</code> 可以批量更新对象中的数值。
</p>
<div class="org-src-container">
<pre class="src src-js">&gt; usr
{ name: <span style="color: #2aa198;">'Tom'</span>, age: 22, foo: <span style="color: #268bd2;">undefined</span> }
&gt; Object.assign(usr, {name: <span style="color: #2aa198;">'Jackson'</span>})
{ name: <span style="color: #2aa198;">'Jackson'</span>, age: 22, foo: <span style="color: #268bd2;">undefined</span> }
&gt;
</pre>
</div>
</div>
</div>
