lang/javascript-distilled.org
*** 对象的键和值
    - ~Object.keys(obj)~ 返回 obj 的键
    - ~Object.values(obj)~ 返回 obj 的值
    - ~Object.entries(obj)~ 返回 obj 的 [key, value] 对

    #+BEGIN_SRC js
      > let o1 = {apple:1, banana:2, orange:3}
      > o1
      { apple: 1, banana: 2, orange: 3 }
      > Object.keys(o1)
      [ 'apple', 'banana', 'orange' ]
      > o1.keys()
      TypeError: o1.keys is not a function
      > Object.values(o1)
      [ 1, 2, 3 ]
      > Object.entries(o1)
      [ [ 'apple', 1 ], [ 'banana', 2 ], [ 'orange', 3 ] ]
      >
    #+END_SRC

** Date 时间和日期
   [[https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Date][Date]] 是表示时间和日期的内置对象

*** 创建日期对象
    ~new Date()~, ~new Date(milliseconds)~ 和 ~new Date(date_str)~ 可以创建日期
    对象
    #+BEGIN_SRC js
      > new Date()
      2019-07-30T06:58:04.792Z
      > new Date(123124123)
      1970-01-02T10:12:04.123Z
      > new Date("2017-01-26")
      2017-01-26T00:00:00.000Z
    #+END_SRC

*** 时间函数
    具体见下面的样例
    #+BEGIN_SRC js
      > let now = new Date()
      > now.getFullYear()
      2019
      > now.getYear()
      119
      > now.getMonth()
      6
      > now.getDate()
      30
      > now.getHours()
      15
      > now.getMinutes()
      5
      > now.getSeconds()
      21
      > now.getMilliseconds()
      725
      > now.getDay()
      2
      >
    #+END_SRC

*** 时间戳
    时间戳有以下函数
    #+BEGIN_SRC js
      // get timestamp
      > now
      2019-07-30T07:05:21.725Z
      > now.getTime()
      1564470321725
      > +now
      1564470321725
      > Date.now()
      1564470538021

      // time diff
      > new Date() - now
      260547
    #+END_SRC

*** 字符串和 Date 互转
    ~Date.parse(str)~, str 应满足 =YYYY-MM-DDTHH:mm:ss.sssZ= 格式
    #+BEGIN_SRC js
      > Date.parse('2012-01-26T13:51:50.417-07:00');
      1327611110417
    #+END_SRC

    Date 转字符串有以下方法
    #+BEGIN_SRC js
      > now.toJSON()
      '2019-07-30T07:05:21.725Z'
      > now.toDateString()
      'Tue Jul 30 2019'
      > now.toISOString()
      '2019-07-30T07:05:21.725Z'
      > now.toString()
      'Tue Jul 30 2019 15:05:21 GMT+0800 (GMT+08:00)'
      > now.toTimeString()
      '15:05:21 GMT+0800 (GMT+08:00)'
      > now.toUTCString()
      'Tue, 30 Jul 2019 07:05:21 GMT'
      >
    #+END_SRC

** JSON
   - ~JSON.stringify(obj)~ 将数组或对象转成 JSON 字符串
   - ~JSON.parse(str)~ 解析 JSON 字符串
   #+BEGIN_SRC js
     > let student = {
     ...   name: 'John',
     ...   age: 30,
     ...   isAdmin: false,
     ...   courses: ['html', 'css', 'js'],
     ...   wife: null
     ... };
     undefined
     > JSON.stringify(student)
     '{"name":"John","age":30,"isAdmin":false,"courses":["html","css","js"],"wife":null}'
     > JSON.stringify([1,2,3])
     '[1,2,3]'
     > JSON.parse('[1,2,3,2,3]')
     [ 1, 2, 3, 2, 3 ]
     >
   #+END_SRC

* 面向对象知识
** ~new~ 关键字和构造器
*** 构造器
    JavaScript 中没有所谓的构造器，它的构造器实际上是一个函数，该函数满足以下两
    点：
    1. 函数名称使用 Pascal case 命名
    2. 函数只能使用 ~new~ 操作符来执行

    例如：
    #+BEGIN_SRC js
      function User(name) {
        this.name = name;
        this.isAdmin = false;
      }

      let user = new User("Jack");

      alert(user.name); // Jack
      alert(user.isAdmin); // false
    #+END_SRC

*** ~new~ 操作符
    ~new~ 操作符做了以下的事情:
    1. 新建了函数作用域的 ~this~ 对象
    2. 并且将新创建的 ~this~ 对象返回
    该过程大致如下面代码所示：
    #+BEGIN_SRC js
      function User(name) {
        // this = {};  (implicitly)

        // add properties to this
        this.name = name;
        this.isAdmin = false;

        // return this;  (implicitly)
      }
    #+END_SRC
