lang/javascript-distilled.html

<div id="outline-container-orge1fd7b4" class="outline-4">
<h4 id="orge1fd7b4"><span class="section-number-4">4.6.5</span> 对象的键和值</h4>
<div class="outline-text-4" id="text-4-6-5">
<ul class="org-ul">
<li><code>Object.keys(obj)</code> 返回 obj 的键</li>
<li><code>Object.values(obj)</code> 返回 obj 的值</li>
<li><code>Object.entries(obj)</code> 返回 obj 的 [key, value] 对</li>
</ul>

<div class="org-src-container">
<pre class="src src-js">&gt; <span style="color: #859900;">let</span> <span style="color: #6c71c4;">o1</span> = {apple:1, banana:2, orange:3}
&gt; o1
{ apple: 1, banana: 2, orange: 3 }
&gt; Object.keys(o1)
[ <span style="color: #2aa198;">'apple'</span>, <span style="color: #2aa198;">'banana'</span>, <span style="color: #2aa198;">'orange'</span> ]
&gt; o1.keys()
TypeError: o1.keys is not a <span style="color: #859900;">function</span>
&gt; Object.values(o1)
[ 1, 2, 3 ]
&gt; Object.entries(o1)
[ [ <span style="color: #2aa198;">'apple'</span>, 1 ], [ <span style="color: #2aa198;">'banana'</span>, 2 ], [ <span style="color: #2aa198;">'orange'</span>, 3 ] ]
&gt;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf625b67" class="outline-3">
<h3 id="orgf625b67"><span class="section-number-3">4.7</span> Date 时间和日期</h3>
<div class="outline-text-3" id="text-4-7">
<p>
<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Date">Date</a> 是表示时间和日期的内置对象
</p>
</div>

<div id="outline-container-org73e8d3a" class="outline-4">
<h4 id="org73e8d3a"><span class="section-number-4">4.7.1</span> 创建日期对象</h4>
<div class="outline-text-4" id="text-4-7-1">
<p>
<code>new Date()</code>, <code>new Date(milliseconds)</code> 和 <code>new Date(date_str)</code> 可以创建日期
对象
</p>
<div class="org-src-container">
<pre class="src src-js">&gt; <span style="color: #859900;">new</span> <span style="color: #268bd2;">Date</span>()
2019-07-30T06:58:04.792Z
&gt; <span style="color: #859900;">new</span> <span style="color: #268bd2;">Date</span>(123124123)
1970-01-02T10:12:04.123Z
&gt; <span style="color: #859900;">new</span> <span style="color: #268bd2;">Date</span>(<span style="color: #2aa198;">"2017-01-26"</span>)
2017-01-26T00:00:00.000Z
</pre>
</div>
</div>
</div>

<div id="outline-container-org7b72f89" class="outline-4">
<h4 id="org7b72f89"><span class="section-number-4">4.7.2</span> 时间函数</h4>
<div class="outline-text-4" id="text-4-7-2">
<p>
具体见下面的样例
</p>
<div class="org-src-container">
<pre class="src src-js">&gt; <span style="color: #859900;">let</span> <span style="color: #6c71c4;">now</span> = <span style="color: #859900;">new</span> <span style="color: #268bd2;">Date</span>()
&gt; now.getFullYear()
2019
&gt; now.getYear()
119
&gt; now.getMonth()
6
&gt; now.getDate()
30
&gt; now.getHours()
15
&gt; now.getMinutes()
5
&gt; now.getSeconds()
21
&gt; now.getMilliseconds()
725
&gt; now.getDay()
2
&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdf00197" class="outline-4">
<h4 id="orgdf00197"><span class="section-number-4">4.7.3</span> 时间戳</h4>
<div class="outline-text-4" id="text-4-7-3">
<p>
时间戳有以下函数
</p>
<div class="org-src-container">
<pre class="src src-js"><span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">get timestamp</span>
&gt; now
2019-07-30T07:05:21.725Z
&gt; now.getTime()
1564470321725
&gt; +now
1564470321725
&gt; Date.now()
1564470538021

<span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">time diff</span>
&gt; <span style="color: #859900;">new</span> <span style="color: #268bd2;">Date</span>() - now
260547
</pre>
</div>
</div>
</div>

<div id="outline-container-orge3016c2" class="outline-4">
<h4 id="orge3016c2"><span class="section-number-4">4.7.4</span> 字符串和 Date 互转</h4>
<div class="outline-text-4" id="text-4-7-4">
<p>
<code>Date.parse(str)</code>, str 应满足 <code>YYYY-MM-DDTHH:mm:ss.sssZ</code> 格式
</p>
<div class="org-src-container">
<pre class="src src-js">&gt; Date.parse(<span style="color: #2aa198;">'2012-01-26T13:51:50.417-07:00'</span>);
1327611110417
</pre>
</div>

<p>
Date 转字符串有以下方法
</p>
<div class="org-src-container">
<pre class="src src-js">&gt; now.toJSON()
<span style="color: #2aa198;">'2019-07-30T07:05:21.725Z'</span>
&gt; now.toDateString()
<span style="color: #2aa198;">'Tue Jul 30 2019'</span>
&gt; now.toISOString()
<span style="color: #2aa198;">'2019-07-30T07:05:21.725Z'</span>
&gt; now.toString()
<span style="color: #2aa198;">'Tue Jul 30 2019 15:05:21 GMT+0800 (GMT+08:00)'</span>
&gt; now.toTimeString()
<span style="color: #2aa198;">'15:05:21 GMT+0800 (GMT+08:00)'</span>
&gt; now.toUTCString()
<span style="color: #2aa198;">'Tue, 30 Jul 2019 07:05:21 GMT'</span>
&gt;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4d46e30" class="outline-3">
<h3 id="org4d46e30"><span class="section-number-3">4.8</span> JSON</h3>
<div class="outline-text-3" id="text-4-8">
<ul class="org-ul">
<li><code>JSON.stringify(obj)</code> 将数组或对象转成 JSON 字符串</li>
<li><code>JSON.parse(str)</code> 解析 JSON 字符串</li>
</ul>
<div class="org-src-container">
<pre class="src src-js">&gt; <span style="color: #859900;">let</span> <span style="color: #6c71c4;">student</span> = {
...   name: <span style="color: #2aa198;">'John'</span>,
...   age: 30,
...   isAdmin: <span style="color: #268bd2;">false</span>,
...   courses: [<span style="color: #2aa198;">'html'</span>, <span style="color: #2aa198;">'css'</span>, <span style="color: #2aa198;">'js'</span>],
...   wife: <span style="color: #268bd2;">null</span>
... };
<span style="color: #268bd2;">undefined</span>
&gt; JSON.stringify(student)
<span style="color: #2aa198;">'{"name":"John","age":30,"isAdmin":false,"courses":["html","css","js"],"wife":null}'</span>
&gt; JSON.stringify([1,2,3])
<span style="color: #2aa198;">'[1,2,3]'</span>
&gt; JSON.parse(<span style="color: #2aa198;">'[1,2,3,2,3]'</span>)
[ 1, 2, 3, 2, 3 ]
&gt;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgcead471" class="outline-2">
<h2 id="orgcead471"><span class="section-number-2">5</span> 面向对象知识</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgc9c5fdd" class="outline-3">
<h3 id="orgc9c5fdd"><span class="section-number-3">5.1</span> <code>new</code> 关键字和构造器</h3>
<div class="outline-text-3" id="text-5-1">
</div>
<div id="outline-container-org1c07f0a" class="outline-4">
<h4 id="org1c07f0a"><span class="section-number-4">5.1.1</span> 构造器</h4>
<div class="outline-text-4" id="text-5-1-1">
<p>
JavaScript 中没有所谓的构造器，它的构造器实际上是一个函数，该函数满足以下两
点：
</p>
<ol class="org-ol">
<li>函数名称使用 Pascal case 命名</li>
<li>函数只能使用 <code>new</code> 操作符来执行</li>
</ol>

<p>
例如：
</p>
<div class="org-src-container">
<pre class="src src-js"><span style="color: #859900;">function</span> <span style="color: #b58900;">User</span>(<span style="color: #6c71c4;">name</span>) {
  <span style="color: #268bd2;">this</span>.name = name;
  <span style="color: #268bd2;">this</span>.isAdmin = <span style="color: #268bd2;">false</span>;
}

<span style="color: #859900;">let</span> <span style="color: #6c71c4;">user</span> = <span style="color: #859900;">new</span> <span style="color: #268bd2;">User</span>(<span style="color: #2aa198;">"Jack"</span>);

alert(user.name); <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">Jack</span>
alert(user.isAdmin); <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">false</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc56b077" class="outline-4">
<h4 id="orgc56b077"><span class="section-number-4">5.1.2</span> <code>new</code> 操作符</h4>
<div class="outline-text-4" id="text-5-1-2">
<p>
<code>new</code> 操作符做了以下的事情:
</p>
<ol class="org-ol">
<li>新建了函数作用域的 <code>this</code> 对象</li>
<li>并且将新创建的 <code>this</code> 对象返回</li>
</ol>
<p>
该过程大致如下面代码所示：
</p>
<div class="org-src-container">
<pre class="src src-js"><span style="color: #859900;">function</span> <span style="color: #b58900;">User</span>(<span style="color: #6c71c4;">name</span>) {
  <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">this = {};  (implicitly)</span>

  <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">add properties to this</span>
  <span style="color: #268bd2;">this</span>.name = name;
  <span style="color: #268bd2;">this</span>.isAdmin = <span style="color: #268bd2;">false</span>;

  <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">return this;  (implicitly)</span>
}
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Last Updated 2019-07-30 Tue 16:45. Created by Jinghui Hu at 2019-07-02 Tue 11:04.</p>
</div>
</body>
</html>
